{"pages":[{"text":"I am an engineer interested in all aspects of networked systems - computer networks (incl. software-defined-networks, network virtualization) and distributed systems. Of particular interest is their application in cloud computing and scalable web backend architectures. This blog is an attempt to put my understanding into words, as I try to delve deeper into the internals of these complex networked systems. I have also been a big fan of Werner Vogel's blog , especially his Back-to-Basics Weekend Reading series. Check it out when you have the time. A section of this blog will be based on that idea. At least once every two weeks, I will pick one of the seminal published research papers that has had a high impact in the area of (distributed systems|computer networking|operating systems|storage), and will publish a writeup based upon my understanding. My background: I work as a software engineer in Silicon Valley working on a cloud-computing product.","tags":"pages","loc":"http://networkedsystems.in/about","title":"About"},{"text":"Open vSwitch ( OVS ) has become the de facto software virtual switch in cloud computing deployments where multi-tenancy is a primary requirement. From the website, OVS is a production quality, multilayer virtual switch designed to enable massive network automation through programmatic extension, while still supporting standard management interfaces and protocols. The complete feature list can be found here . In this post, we will walk through the steps necessary to build OVS RPMs for Oracle's Unbreakable Enterprise Kernel v6. Environment I will be using the following OL6 Kernel and OVS version 2.1.2: 1 2 3 4 5 bash-4.1# uname -r 2.6.39-400.109.4.el6uek.x86_64 bash-4.1# ls openvswitch* openvswitch-2.1.2.tar.gz Build OVS RPMs Get the OL6 yum configuration file from Oracle's public yum server. 1 2 bash-4.1# cd /etc/yum.repos.d bash-4.1# wget http://public-yum.oracle.com/public-yum-ol6.repo Edit the public-yum-ol6.repo configuration file to enable the OL6_UEK_latest repository. 1 2 3 4 5 6 [ol6_UEK_latest] name=Latest Unbreakable Enterprise Kernel for Oracle Linux $releasever ($basearch) baseurl=http://public-yum.oracle.com/repo/OracleLinux/OL6/UEK/latest/$basearch/ gpgkey=file:///etc/pki/rpm-gpg/RPM-GPG-KEY-oracle gpgcheck=1 enabled=1 Update yum and install the packages listed below. 1 2 3 4 bash-4.1# yum update bash-4.1# yum install -y autoconf automake gcc libtool rpm-build bash-4.1# yum install -y openssl-devel python-devel kernel-uek-debug-devel bash-4.1# yum install -y kernel-uek-devel redhat-rpm-config kabi-whitelists OL6 has a broken build symbolic link. A ls command on /lib/modules/`uname -r`/build/ should result in a directory listing from /usr/src/kernel/`uname -r` . On OL6 , it results in a \"No such file or directory\" error. We need to fix this. 1 2 bash-4.1# rm /lib/modules/ ` uname -r ` /build bash-4.1# ln -s /usr/src/kernels/ ` uname -r ` /lib/modules/ ` uname -r ` /build Create the RPM building environment, 1 bash-4.1# mkdir -p ~/rpmbuild/ { SOURCES,RPMS,BUILD,SPECS,SRPMS } Copy over the Open vSwitch source tar.gz file to the RPM SOURCES directory, and untar it. Copy the openvswitch-kmod.files file to the RPM SOURCES directory as well. 1 2 3 bash-4.1# cp ~/openvswitch-2.1.2.tar.gz ~/rpmbuild/SOURCES bash-4.1# cd ~/rpmbuild/SOURCES; tar -xzf openvswitch-2.1.2.tar.gz bash-4.1# cp openvswitch-2.1.2/rhel/openvswitch-kmod.files ./ Next, build userspace component of OVS 1 2 bash-4.1# cd openvswitch-2.1.2 bash-4.1# rpmbuild -bb rhel/openvswitch.spec Build the OVS kernel module 1 bash-4.1# rpmbuild -bb -D \"kversion `uname -r`\" -D \"kflavors default debug\" rhel/openvswitch-kmod-rhel6.spec This results in the following four RPMs: 1 2 bash-4.1# ls ~/rpmbuild/RPMS/x86_64/ kmod-openvswitch-2.1.2-1.el6.x86_64.rpm kmod-openvswitch-debug-2.1.2-1.el6.x86_64.rpm openvswitch-2.1.2-1.x86_64.rpm openvswitch-debuginfo-2.1.2-1.x86_64.rpm kmod-* are the OVS kernel module RPMs and openvswitch-* are the RPMs for the userspace component of OVS . As is evident, this guide is very specific to Oracle's UEKv6. In a future post, I will be talking more about the features and capabilities that OVS provides. I will also show how OVS can be used to create multi-tenant virtual network overlays using VXLAN / GRE tunnels.","tags":"guide","loc":"http://networkedsystems.in/ovs-uek-build-install","title":"Building Open vSwitch RPMs for Oracle Unbreakable Enterprise Linux 6"}]}